Philip-Kiehnle/PVBatteryInverter/STM32_Code/STM32_PVBatteryInverter/Core/Src/ac_control.cpp

#include "stm32g4xx_hal.h"

#include <string.h>
#include <stdio.h>
#include <stdbool.h>
#include <math.h>
#include <algorithm>
#include <climits>

#include "gpio.h"
#include "common.h"
#include "monitoring.h"
#include "ac_control.h"
#include "dc_control.h"

#include "controller.h"
#include "sogi_pllFXP.h"

// single PWM step has 1/170MHz = 5.88ns
// deadtime is configured to 64ns (10k resistor)
//#define MIN_PULSE 18  // min pulse duration is 106ns - 64ns deadtime = 42ns

#define AC_DUTY_ABSMAX 8500
#define AC_DUTY_HALF (AC_DUTY_ABSMAX/2)


volatile uint16_t v_dc_FBgrid_sincfilt_100mV;
volatile int16_t v_ac_amp_filt50Hz_100mV;
volatile int16_t i_ac_10mA;
volatile int16_t p_ac_filt50Hz;
volatile int16_t p_ac_filt1minute;

volatile int16_t debug_v_ac_rms_100mV;
volatile int16_t debug_f_ac_10mHz;
volatile int16_t debug_i_ac_ref_amp_10mA;


volatile enum stateAC_t stateAC = INIT_AC;
bool sampling_trig_en = false;

static int16_t permil_v_dffw = PERMIL_V_DFFW_MIN;  // per mil of direct voltage feedforward

static uint32_t cnt_rel = 0;

static int cnt_intr = 0;  // for sigma_delta processing


const int16_t get_v_ac_amp_filt50Hz_100mV()
{
	return v_ac_amp_filt50Hz_100mV;
}


const int16_t get_p_ac_filt50Hz()
{
	return p_ac_filt50Hz;
}


const int16_t get_p_ac_filt1minute()
{
	return p_ac_filt1minute;
}


void fill_monitor_vars_ac(monitor_vars_t* mon_vars)
{
	mon_vars->stateAC = stateAC;
	mon_vars->f_ac_10mHz = debug_f_ac_10mHz;
	mon_vars->v_ac_rms_100mV = debug_v_ac_rms_100mV;
	mon_vars->i_ac_ref_amp_10mA = debug_i_ac_ref_amp_10mA;
	mon_vars->p_ac_filt50Hz = p_ac_filt50Hz;

	mon_vars->v_dc_FBgrid_sincfilt_100mV = v_dc_FBgrid_sincfilt_100mV;
}


void shutdownAC()
{
	gatedriverAC(0);
	contactorAC(0);
}


static inline void nextState(enum stateAC_t state)
{
	stateAC = state;
	cnt_rel = 0;
}


static inline bool check_zero_crossing(int16_t phase)
{
	if ( phase > (0.25*INT16_MAX) && phase < (0.27*INT16_MAX) ) {
		return true;
	}
	return false;
}


static inline bool check_zero_crossing_contactor_comp(int16_t phase)
{
	// V1: contactor closes 5.96ms after zero voltage without compensation
	// -> wait (10-5.96)/20=0.202 cycles
	// todo: change phase range from two cycles to one. Then change to 2*0.202=0.404 *INT16_MAX
	//V2: close is 0.6ms after zero with V1; But with V2 next try, 0.7us before zero. Okay because voltage decreases
	// wait (10-6.56)/20=0.172 cycles
	if ( phase > ((0.25+0.172)*INT16_MAX) && phase < ((0.27+0.172)*INT16_MAX) ) {
		return true;
	}
	return false;

	// opening contactor: second bounce 745us after first, third bounce 905us after first, bounce time ~1ms
}


// todo: add controller for stationary accuracy for p_bat_reduction and p_external, e.g. later in code when P is converted to current
void calc_p_ac(control_ref_t* ctrl_ref)
{
	int16_t p_default = ctrl_ref->p_ac_pccCtrl + get_p_ac_bat_chg_reduction();

	if (ctrl_ref->ext_ctrl_mode == EXT_AC_HARD) {
		ctrl_ref->p_ac_rms = ctrl_ref->p_ac_external;  // risk of BMS action; useful for BMS test
	} else if (ctrl_ref->ext_ctrl_mode == EXT_AC_SOFT) {
		// Avoid grid consumption in EXT_AC_SOFT mode
		// and take into account, that battery may need charge power reduction.
		// -> Use the sum of the PI controllers. Values are >=0
		int16_t p_ac_rms = p_default;

		// The controller outputs of PCC and Pbat_reduction are limited to P_AC_MAX,
		// so p_ac_external has to be clamped in a way that p_ac_rms can reach the limits [-P_AC_MAX;P_AC_MAX]
		// -> clamp the opposite direction
		int16_t p_ac_external_clamped = std::clamp(ctrl_ref->p_ac_external, (int16_t)(-P_AC_MAX+ctrl_ref->p_ac_pccCtrl), (int16_t)P_AC_MAX);
		p_ac_external_clamped = std::clamp(p_ac_external_clamped, (int16_t)(-P_AC_MAX+get_p_ac_bat_chg_reduction()), (int16_t)P_AC_MAX);
		// todo battery discharge reduction
		p_ac_rms += p_ac_external_clamped;

		ctrl_ref->p_ac_rms = p_ac_rms;

	} else {
		ctrl_ref->p_ac_rms = p_default;
	}
}


int16_t acControlStep(uint16_t cnt20kHz_20ms, control_ref_t ctrl_ref, uint16_t v_dc_FBboost_sincfilt_100mV, uint16_t v_dc_FBboost_filt50Hz_100mV, int16_t v_ac_raw, uint16_t i_ac_raw)
{
	//DEBUG_ISR GPIOC->BSRR = (1<<15);  // set Testpin TP202 PC15; pin operation takes some extra time
	static int16_t duty = 0;
	static uint32_t cnt_pll_locked = 0;
	static uint32_t low_power_mode_cnt = 0;

	bool acGrid_valid = false;

	// Grid current
	i_ac_10mA = (i_ac_raw-IAC_OFFSET_RAW) * IAC_RAW_TO_10mA;

	// Grid voltage
	int16_t v_ac_100mV = (((int32_t)v_ac_raw) * (10*VGRID_ADCR) )/(1<<ADC_BITS_VGRID);
	int32_t vd = pll_get_vd();
	int16_t v_ac_amp_100mV = (((int32_t)vd) * (10*VGRID_ADCR) )/(1<<ADC_BITS_VGRID);
	int16_t v_ac_rms_100mV = (((int32_t)vd) * ((10*VGRID_ADCR)/M_SQRT2) )/(1<<ADC_BITS_VGRID);
	debug_v_ac_rms_100mV = v_ac_rms_100mV;

	//static int16_t v_ac_rms_filt50Hz_100mV = 0;
	static int32_t v_ac_amp_sum = 0;
	v_ac_amp_sum += v_ac_amp_100mV;

	static int32_t i_ac_sum = 0;
	i_ac_sum += i_ac_10mA;
	static uint8_t cnt_dc_offset = 0;

	int v_dcCtrl_mV = 0;
	//static int v_dcCtrl_I_mV;
	//static int16_t i_ac_dc_offset_mA;

	if (cnt20kHz_20ms == 0) {
		v_ac_amp_filt50Hz_100mV = v_ac_amp_sum/CYCLES_cnt20kHz_20ms;
		//v_ac_rms_filt50Hz_100mV = ((float)v_ac_amp_filt50Hz_100mV) / M_SQRT2;
		v_ac_amp_sum = 0;

		debug_v_dc_FBgrid_sincfilt_100mV = v_dc_FBgrid_sincfilt_100mV;

		//i_ac_dc_offset_mA = (i_ac_sum*10)/CYCLES_cnt20kHz_20ms;

		// check DC component in AC current
		if ( i_ac_sum > (E_I_AC_DC_OFFSET_MAX_10mA*CYCLES_cnt20kHz_20ms) ) {
			i_ac_sum = 0;
			cnt_dc_offset++;
			if (cnt_dc_offset >= E_I_AC_DC_OFFSET_CYCLES) {
				set_sys_errorcode(EC_I_AC_DC_OFFSET);
			}
		} else {
			cnt_dc_offset = 0;
		}
	}

	// DC voltage
	uint16_t v_dc_sinc_mix_100mV = (v_dc_FBboost_sincfilt_100mV + v_dc_FBgrid_sincfilt_100mV)/2;

	// no 100Hz ripple prediction + extra filter -> Pac ~100W: 45.6V to 47.0V instead of 44.9V to 47.8V FBgrid_sincfilt
	//static uint16_t v_dc_prev[3] = {0};
	//uint16_t v_dc_modulator_100mV = lowpass4(v_dc_sinc_mix_100mV, v_dc_prev);

	// 100Hz ripple prediction because sinc filter is too slow to provide precise modulator voltage
	// sinc filter adds average delay of 16/20kHz = 0.8ms. New sample 0.4ms up to 1.2ms
	static uint16_t v_dc_modulator_100mV;
	//static int16_t delta_v_prev8_10mV;
	//static int16_t delta_v_10mV;

	int p_ac_mW = -i_ac_10mA*v_ac_100mV;
#define BATTERY_FACTOR_PERCENT 20  // define part of 100Hz ripple which is taken by battery

//  fixed point capacitor ripple compensation
//	disadvantage: battery part is hard to estimate
//	              calculation time needed
//	              external events are delayed
//	=> todo: implement direct V_DC measurement without software sigma delta converter
//	int32_t p_cap_10mW = ((100-BATTERY_FACTOR_PERCENT) * ( p_ac_filt50Hz - (p_ac_mW/1000)) );  // p_cap >0 (charging) if actual p_ac < pac_rms
//	constexpr uint16_t COEF = AC_CTRL_FREQ*CAPACITANCE;  // 20000×4×390×10^−6 = 31.2
//	delta_v_10mV += (p_cap_10mW*10)/(v_dc_modulator_100mV*COEF);
//	if (cnt_intr == 0) {
//		delta_v_10mV = (delta_v_10mV-delta_v_prev8_10mV);  // compensates measurement delay
//	} else if (cnt_intr == 8) {
//		delta_v_prev8_10mV = delta_v_10mV;
//	}
//
//	v_dc_modulator_100mV = v_dc_sinc_mix_100mV + delta_v_10mV/10;

	// for stability during test
	//v_dc_modulator_100mV = 490;
	//v_dc_modulator_100mV = v_dc_FBboost_filt50Hz_100mV;
	v_dc_modulator_100mV = v_dc_sinc_mix_100mV;

	// grid frequency
	int32_t w = pll_get_w();
	debug_f_ac_10mHz = (w*100)>>15; // todo: check if (2^15)-1

#define DEBUG_OUTPUT_CURRENT 0  // for testing output current without grid
#if DEBUG_OUTPUT_CURRENT == 0
	if (vd >= VD_MIN_RAW && vd <= VD_MAX_RAW &&
	     w >= W_MIN_RAW && w <= W_MAX_RAW) {
	  if (cnt_pll_locked >= 0.2*AC_CTRL_FREQ) {  // 200ms
		  acGrid_valid = true;
	  } else {
		  cnt_pll_locked++;
	  }
	} else {
	  shutdownAC();
	  acGrid_valid = false;
	  if (stateAC >= WAIT_CONTACTOR_AC) {
		  if (vd < VD_MIN_RAW) {
			set_sys_errorcode(EC_V_AC_LOW);
		  } else if (vd > VD_MAX_RAW) {
			set_sys_errorcode(EC_V_AC_HIGH);
		  } else if (w < W_MIN_RAW) {
			set_sys_errorcode(EC_FREQ_AC_LOW);
		  } else if (w > W_MAX_RAW) {
			set_sys_errorcode(EC_FREQ_AC_HIGH);
		  } else {
		  	set_sys_errorcode(EC_GRID_SYNC_LOST);
	  	  }
	  }
	  stateAC = INIT_AC;
	  cnt_pll_locked = 0;
	}
	int16_t phase = pll_singlephase_step(v_ac_raw);
#else
	acGrid_valid = true;
	v_ac_amp_filt50Hz_100mV = VGRID_AMP*10;
	static int16_t phase;
	phase += SHRT_MAX/(AC_CTRL_FREQ/50);  // generate 50Hz
#endif //DEBUG_OUTPUT_CURRENT

	if (get_sys_errorcode() != EC_NO_ERROR ) {
		shutdownAC();
		stateAC = INIT_AC;
	} else if (ctrl_ref.mode == AC_OFF) {
		gatedriverAC(0);  // get current to zero before contactor action. todo: check
		stateAC = INIT_AC;
	}

	cnt_rel++;

	static int p_ac_sum_mW;  // max +-5.3kW
	p_ac_sum_mW += p_ac_mW;

	static uint16_t i_ac_amp_gain = 115;

	if (cnt20kHz_20ms == 0) {
		p_ac_filt50Hz = p_ac_sum_mW/CYCLES_cnt20kHz_20ms/1000;

		// only relevant for PAC_CONTROL for now:
		// 70% to 130% gain to compensate for inductor model missmatch and grid harmonics
		if (low_power_mode_cnt == 0) {  // skip if energy packet controller disabled the gate signals
			if (   (p_ac_filt50Hz > ctrl_ref.p_ac_rms && ctrl_ref.p_ac_rms > 0)  // feedin is positive: 500 but want 460 -> reduce gain
			    || (p_ac_filt50Hz < ctrl_ref.p_ac_rms && ctrl_ref.p_ac_rms < 0)  // consumption is negative: -500 but want -460 -> reduce gain
			) {
				if (i_ac_amp_gain > 70) i_ac_amp_gain--;
			} else {
				if (i_ac_amp_gain < 130) i_ac_amp_gain++;
			}
		}
		p_ac_sum_mW = 0;

	} else if (cnt20kHz_20ms == 1) {

		static uint16_t cnt50Hz_1min;
		cnt50Hz_1min++;

		// todo thermal model for AC side -> more output power for pulse loads and cloudy days 1.2kW nom 1.6kW max

		static int p_ac_sum_1minute;
		p_ac_sum_1minute += p_ac_filt50Hz;

		if (cnt50Hz_1min == 60*50) {
			cnt50Hz_1min = 0;
			p_ac_filt1minute = p_ac_sum_1minute/(60*50);
			p_ac_sum_1minute = 0;
		}
	}

	int16_t phaseshift_RL = 0;
	int v_amp_pred_100mV = 0;
	int v_prCtrl_10mV = 0;

	switch (stateAC) {
	  case INIT_AC:
		shutdownAC();
		if (get_sys_errorcode() == EC_NO_ERROR ) {
			if (ctrl_ref.mode != AC_OFF) {
				nextState(WAIT_AC_DC_VOLTAGE);
			}
		}
		break;

