Philip-Kiehnle/PVBatteryInverter/STM32_Code/STM32_PVBatteryInverter/Core/Src/ac_control.cpp
	  case WAIT_AC_DC_VOLTAGE:
		if (   acGrid_valid
#ifndef USE_TRAFO_33V
#error "USE_TRAFO_33V has to be defined as 0 or 1"
#endif
#if USE_TRAFO_33V == 1
			&& v_dc_FBgrid_sincfilt_100mV > 315*10  // no precharge resistors available
			&& v_dc_FBgrid_sincfilt_100mV > 315*10
#else
		    && v_dc_FBgrid_sincfilt_100mV > v_ac_amp_100mV  // no precharge resistors available
		    && v_dc_FBgrid_sincfilt_100mV > v_ac_amp_filt50Hz_100mV
#endif
		    && cnt_rel >= 2*AC_CTRL_FREQ)  // wait at least 2 sec to avoid instabilities
		 {
			// zero crossing of grid and converter voltage tuning:
#if USE_TRAFO_33V == 1
			//pll_set_phaseOffset((1<<15) * +10.05/20);  // i_rms 260-365mA
			pll_set_phaseOffset((1<<15) * +10.0/20);  // i_rms 130-169mA; grid leading 5;10;13us lagging 6;13;18;28;47us
			//pll_set_phaseOffset((1<<15) * +9.99/20);  // i_rms 121-147mA  sun/PV input has influence to grid: 260-320mA
			//pll_set_phaseOffset((1<<15) * +9.98/20);  // i_rms 119-135mA; 209-213mA with sun; grid leading 0;18.1-18.7;41;47us
			//pll_set_phaseOffset((1<<15) * +9.95/20);  // i_rms 120-138mA
#else
			// direct grid
			// 10us deviation means voltage difference of 325*sin(2*pi*50Hz*10us) = 1.02V ; (2pi*50HZ*2mH) -> 1V/0.6A = 1.6A
			//pll_set_phaseOffset((1<<15) * +10.0/20); // with 2x1kW resistance: EnergyMeter ~200VA
			//pll_set_phaseOffset((1<<15) * +9.99/20);  // no 25kHZ ringing without FFWD but +-2A i_ac
			//pll_set_phaseOffset((1<<15) * +9.98/20);  // with 2x1kW resistance: EnergyMeter ~16W ~20VA; without PV 3.2W 11-15VA; direct AC no PV: 2.6-5.2W, 80VA; 75W-Emu: ~70VA 24kHz Oscillation with 20%FFW; 0%FFD 200VA +-1.8A
			//pll_set_phaseOffset((1<<15) * +9.96/20);  // +-1.3A i_ac 170VA
			//pll_set_phaseOffset((1<<15) * +9.95/20);  // +-0.91A i_ac Osci i_rms_cyc= 305mA i_mean_cyc=52mA; 70VA CONTROL_PERIOD
			pll_set_phaseOffset((1<<15) * +9.9477/20);  // +-0.80A i_ac Osci i_rms_cyc= 276mA i_mean_cyc=13mA; 69VA CONTROL_PERIOD + 1.28us group delay of analog filter + 1.02us delay of AMC3330 -> second test 73VA 4.4-6W
			//pll_set_phaseOffset((1<<15) * +9.9467/20);  // +-0.80A i_ac Osci i_rms_cyc= 315mA i_mean_cyc=-17mA; 72VA CONTROL_PERIOD + 1.28us group delay of analog filter + 2.02us delay of AMC3330
			//pll_set_phaseOffset((1<<15) * +9.94/20);  // +-0.80A i_ac Osci i_rms_cyc= 320mA i_mean_cyc=-10mA; 73VA
#endif
			nextState(WAIT_ZERO_CROSSING);
		}
		break;

	  case WAIT_ZERO_CROSSING:  // for LCL charge without overshoot
		if ( check_zero_crossing_contactor_comp(phase) ) {
			nextState(CLOSE_CONTACTOR_AC);
		} else if (v_dc_FBgrid_sincfilt_100mV < (v_ac_amp_filt50Hz_100mV-4*10)) {
			// in case no zerocrossing is detected and dc voltage drops
			nextState(WAIT_AC_DC_VOLTAGE);
		}
		break;

	  case CLOSE_CONTACTOR_AC:
		gatedriverAC(1);
		contactorAC(1);
		nextState(WAIT_CONTACTOR_AC);


	  case WAIT_CONTACTOR_AC:
		if (cnt_rel == 0.025*AC_CTRL_FREQ) {  // 25ms delay for contactor action
  			nextState(GRID_CONNECTING);
		}
		break;

	  case GRID_CONNECTING:
		  // todo implement islanding detection in GRID_CONNECTING
		piCtrl.y = 0;
		piCtrl.x_prev = 0;
		//v_dcCtrl_I_mV = 0;
		gatedriverAC(1);
		nextState(GRID_SYNC);
		break;

	  case GRID_SYNC:
	  {

//		if (cnt_rel >= 2.0*AC_CTRL_FREQ) {  // short turnon for testing
//			nextState(WAIT_AC_DC_VOLTAGE);
//			gatedriverAC(0);
//		}

		// trafo with
		// 2 winding systems in series and 5 windings in opposite direction has 44.7Vpeak at 227.0V grid and 1.6W loss
		// 2 winding systems in series and 5 windings in same direction has 47.9Vpeak at 227,0V grid
		// -> feedin down to 2.98Vcell
		// -> added another 4 windings in opposite direction 45.8Vpeak when feedin 4A

		// 0,5mm2 white wire inside inverter can carry max 12A : todo check

		// #########################
		// ### control algorithm ###
		// #########################

		// problems:
		// 1. high delay from grid current rise until voltage rise ~1ms. Maybe caused by LCL filter -> old
		// 2. unloaded LCL output and high dutycycle causes ringing with 1.66kHz 70Vpp
		//    starts with Umid1 not switching at all for 100us = 2PWM periods. Pulse before was 400us so no dutycycle limit
		//    starts also with Umid2 not switching at all for 54us = 1PWM periods
		//    problem exists in PWM 3.3V signal
		//    => solved by compare unit 1 config: "greater than" instead of "equal"
		// 3. clipping : if DC voltage is too small for clean sine wave, reduce current

//#define EXTEND_LOC 8
////#define SCALE_VAC2VDC (int32_t)( ((VGRID_ADCR/VGRID_TRATIO) / VIN_ADCR ) * (1<<EXTEND_LOC) )
//#define SCALE_VAC2VDC (int32_t)( ((VGRID_ADCR) / (VIN_ADCR) ) * (1<<EXTEND_LOC) )

		// grid current feedforward
		//if (cnt_rel >= 1.0*AC_CTRL_FREQ) {  // turnon for testing
			static int16_t i_ac_ref_amp_10mA = 0;
			switch (ctrl_ref.mode) {
			  case AC_PASSIVE:  // for battery reconnect to avoid DC voltage controller fighting AC Vdc voltage controller
				gatedriverAC(0);
				nextState(WAIT_CONTACTOR_AC);  // todo gatedriver is turned on for short period
				break;

			  case VDC_CONTROL:
				gatedriverAC(1);
				i_ac_ref_amp_10mA = step_pi_Vdc2IacAmp( ctrl_ref.v_dc_100mV*10, v_dc_sinc_mix_100mV*10 );
				//i_ac_amp_10mA = step_pi_Vdc2IacAmp_volt_comp( ctrl_ref.v_dc_100mV*10, v_dc_sinc_mix_100mV*10, phase, 10*v_ac_amp_filt50Hz_100mV);
				break;

			  case VDC_VARIABLE_CONTROL:
			  {
				gatedriverAC(1);
				// sine in modern power grid is flattened -> no extra headroom needed
				uint32_t v_dc_ref_10mV = 10*v_ac_amp_filt50Hz_100mV + ((R*64)*i_ac_ref_amp_10mA)/64;
				i_ac_ref_amp_10mA = step_pi_Vdc2IacAmp( v_dc_ref_10mV, v_dc_sinc_mix_100mV*10 );
				//i_ac_amp_10mA = step_pi_Vdc2IacAmp_volt_comp( ctrl_ref.v_dc_100mV*10, v_dc_sinc_mix_100mV*10, phase, 10*v_ac_amp_filt50Hz_100mV);
				break;
			  }

			  case PAC_CONTROL:
			  {
				// use power reference from power controller
				//int i_ac_amp_10mA_unclamped = 100 * (2*ctrl_ref.p_ac_rms*10) / v_ac_amp_filt50Hz_100mV;  // P_ref=460W Pelv=400W
				//int i_ac_amp_10mA_unclamped = 115 * (2*ctrl_ref.p_ac_rms*10) / v_ac_amp_filt50Hz_100mV;  // Pelv (energy meter) shows wide range during 24hours
				int i_ac_amp_10mA_unclamped = i_ac_amp_gain * (2*ctrl_ref.p_ac_rms*10) / v_ac_amp_filt50Hz_100mV;  // variable gain

				// V1: clamp
				//i_ac_amp_10mA = std::clamp(i_ac_amp_10mA_unclamped, -(int)IAC_AMP_MAX_10mA, (int)IAC_AMP_MAX_10mA);

				// V2: ramp: max decent per 50Hz period: 20kHz/50Hz * 10mA = 4A
				if (i_ac_amp_10mA_unclamped > i_ac_ref_amp_10mA  && i_ac_ref_amp_10mA < IAC_AMP_MAX_10mA) {
					i_ac_ref_amp_10mA++;
				} else if (i_ac_amp_10mA_unclamped < i_ac_ref_amp_10mA  && i_ac_ref_amp_10mA > -IAC_AMP_MAX_10mA) {
					i_ac_ref_amp_10mA--;
				}

				// V3: ramp: max decent per 50Hz period: 20kHz/50Hz * 1mA = 0.4A -> 6.5kW/sec, but no DC current improvement
//				static int i_ac_ref_amp_1mA = 0;  // todo: reset to i_ac_ref_amp_10mA
//				if (i_ac_amp_10mA_unclamped > i_ac_ref_amp_10mA && i_ac_ref_amp_10mA < IAC_AMP_MAX_10mA) {
//					i_ac_ref_amp_1mA++;
//				} else if (i_ac_amp_10mA_unclamped < i_ac_ref_amp_10mA && i_ac_ref_amp_10mA > -IAC_AMP_MAX_10mA) {
//					i_ac_ref_amp_1mA--;
//				}
//				i_ac_ref_amp_10mA = i_ac_ref_amp_1mA/10;

#define ENABLE_LOW_POWER_ENERGY_PACKET_CONTROLLER 0
#if ENABLE_LOW_POWER_ENERGY_PACKET_CONTROLLER == 1 && SYSTEM_HAS_BATTERY == 1
constexpr uint16_t P_LOW_POWER_CTRL_REENABLE = 160;  // 200 leads to 400mWh sold in 10 minutes and 600mWh buyed
				// electricity meter stores energy in 100mWh
				//-> in 1 sec, 100mWh/1sec=360W offset can be tolerated
				// if feedin is included, 720Ws can be tolerated -> todo

				if (    ((ctrl_ref.p_ac_rms <= 50 && get_p_dc_filt50Hz() < 40) || ctrl_ref.p_ac_rms <= 20) // reduce number of switching events during PV production
					 && ctrl_ref.p_pcc <= 10 && (get_p_ac_max_dc_lim() > P_LOW_POWER_CTRL_REENABLE)
					 && check_zero_crossing(phase)  // turnoff during zero crossing reduces "click" noise in inductor
					 && ctrl_ref.ext_ctrl_mode == EXT_OFF  // do not use packet mode in case of external power control
				) {
					gatedriverAC(0);
					low_power_mode_cnt++;
				} else if (low_power_mode_cnt) {
					if(    ctrl_ref.p_ac_rms > P_LOW_POWER_CTRL_REENABLE  // 200/50 = 3sec off / 1sec on, depends on power_controller tuning, see calc sheet
						|| ( low_power_mode_cnt > (AC_CTRL_FREQ*3) && (get_p_ac_max_dc_lim() < P_LOW_POWER_CTRL_REENABLE) )  // en if power controller is limited by reduced battery power
						|| ctrl_ref.ext_ctrl_mode != EXT_OFF  // leave packet mode in case of external power control
					) {
						gatedriverAC(1);
						low_power_mode_cnt = 0;
						if (i_ac_ref_amp_10mA > 100) {
							i_ac_ref_amp_10mA = 100;  // clamp to 1A for starting point
						}
					}
				}
#endif

				break;
			  }
			  case FFWD_ONLY:
			  default:
				break;
			}

			debug_i_ac_ref_amp_10mA = i_ac_ref_amp_10mA;
			int i_ref_10mA = (i_ac_ref_amp_10mA * (int32_t)cos1(phase))>>15;

