Philip-Kiehnle/PVBatteryInverter/STM32_Code/STM32_PVBatteryInverter/Core/Src/ac_control.cpp
#define USE_AC_DC_OFFSET_CONTROLLER 0
#if USE_AC_DC_OFFSET_CONTROLLER == 1
			if (cnt20kHz_20ms == 0) {
				// control DC offset in AC current
				// assume R = 0.7 todo use exact R
				// 2A offset needs V = 1.4V DC voltage

				// zu wenig
//				const uint8_t KP_DIV = 2;
//				const uint8_t KI_DIV = 4;

				const uint8_t KP_DIV = 1;
				const uint8_t KI_DIV = 2;
#define EXTRA_GAIN 4
		#define V_AC_DC_OFFSET_MAX_mV (16*1000)
				int16_t v_ac_dc_mV = (i_ac_dc_offset_mA*(EXTRA_GAIN*0.7*32))/32;

				v_dcCtrl_I_mV += v_ac_dc_mV / KI_DIV;
				v_dcCtrl_I_mV = std::clamp(v_dcCtrl_I_mV, (int)(-V_AC_DC_OFFSET_MAX_mV), (int)V_AC_DC_OFFSET_MAX_mV);
				v_dcCtrl_mV = v_ac_dc_mV/KP_DIV + v_dcCtrl_I_mV;
				v_dcCtrl_mV = std::clamp(v_dcCtrl_mV, (int)(-V_AC_DC_OFFSET_MAX_mV), (int)V_AC_DC_OFFSET_MAX_mV);
				//v_dcCtrl_mV = -4000; // -4.0A
				//v_dcCtrl_mV = -10000; // -3.9A depend on switch on?
			}
#endif

			// V1: linear inductor model
			//v_amp_pred_100mV = calc_IacAmp2VacSecAmpDCscale(i_ac_ref_amp_10mA)/10;

			// V2: saturating inductor model; uses LUT with nonlinear inductance or remanence model
			//v_amp_pred_100mV = calc_v_amp_pred(i_ac_ref_amp_10mA, i_ac_10mA/10)/10;  // i_meas -> audible noise 150Hz:-10dBV 250Hz:-23dBV
			v_amp_pred_100mV = calc_v_amp_pred(i_ac_ref_amp_10mA, i_ref_10mA/10)/10;  // i_ref -> audible noise 150Hz:-11dBV 250Hz:-26dBV
			//v_amp_pred_100mV = calc_v_amp_pred(i_ac_ref_amp_10mA, (i_ac_10mA+i_ref_10mA)/(2*10)) /10;
		//}
		phaseshift_RL = get_IacPhase();
		//int16_t phase_shiftRL = get_IacPhase()+ (int16_t)(((1<<15)*1.08)/20);
		//OLD: Strom(3,5Aamp) in Phase bei 40,5W/42,5VA (25,4Vdc bis 27,3Vdc)

		// proportional resonant current controller
		// 16.02.2024: does not compensate saturating inductor -> using 1D saturation LUT feedforward only
//		v_prCtrl_10mV = pr_step(i_ref_10mA-i_ac_10mA);
//		v_prCtrl_10mV = std::clamp(v_prCtrl_10mV, -3*100, 3*100);

		break;
	  }
      default:
          break;
      }

	// grid voltage feedforward
#if DEBUG_OUTPUT_CURRENT == 0
	int32_t v_amp_pll_100mV = v_ac_amp_filt50Hz_100mV;
	int32_t v_pll = v_amp_pll_100mV*(int32_t)cos1(phase);  // range: +-6553V
	#define SCALE_FFW 6
	v_pll >>= SCALE_FFW;  // with permil gain in next step, range will be: *64/1000 -> +- 419V
	int32_t v_ffw = (permil_v_dffw*((-v_ac_100mV)<<(15-SCALE_FFW)) + (1000-permil_v_dffw)*v_pll)/1000;
	v_ffw <<= SCALE_FFW;
#else
	int32_t v_ffw = 0;
#endif

	int32_t vout = (v_ffw + v_amp_pred_100mV*(int32_t)cos1(phase+phaseshift_RL) + (v_prCtrl_10mV<<15)/10 + (v_dcCtrl_mV<<15)/100 ) / v_dc_modulator_100mV;

	duty = AC_DUTY_HALF + ( (AC_DUTY_HALF*vout) >> 15 );
//	duty = AC_DUTY_HALF + ( ( (AC_DUTY_HALF)*(int32_t)cos1(phase) ) >> 15 );  // MAX amplitude test

	//duty = 8500 - 2*3; // PWMA 35.6ns low  -> 6*2*2.94ns
	//duty = 8500 - 5; // PWMA 29ns low  < 3 periods of the fHRTIM !
	//duty = 8500 - 4; // PWMA 23.8ns low  < 3 periods of the fHRTIM !
//	duty = 8500 - 3;  // PWMA always low !!,  PWM B high
//	duty = 0;  // PWMA always low, PWM B high


// single PWM step has 1/(2*170MHz) = 2.94ns  -> center aligned PWM -> 5.88ns
// deadtime is configured to 64ns (10k resistor)
#define MIN_PULSE_HRTIM 18  // min pulse duration is 106ns - 64ns deadtime = 42ns

	// 100% duty: neg wave 571us high and not even small pulses. pos wave has 23.6ns low pulses
	if (duty > (AC_DUTY_ABSMAX-MIN_PULSE_HRTIM/2)) {
	  duty = AC_DUTY_ABSMAX-4;  // todo implement 100% duty: okay for now because gatedriver ignores small pulses
	} else if (duty > (AC_DUTY_ABSMAX-MIN_PULSE_HRTIM)){
	  duty = AC_DUTY_ABSMAX-MIN_PULSE_HRTIM;
	} else if (duty < MIN_PULSE_HRTIM) {
		if (duty > MIN_PULSE_HRTIM/2) {
			duty = MIN_PULSE_HRTIM;
		} else {
			duty = 0;
		}
	}

	if (fast_mon_vars_trig) {
		if (frame_nr < FAST_MON_FRAMES) {
			//fast_monitor_vars[frame_nr].v_dc = v_dc_FBgrid_sincfilt_100mV;
			//fast_monitor_vars[frame_nr].v_dc = delta_v_10mV;
			fast_monitor_vars[frame_nr].duty = duty;
			fast_monitor_vars[frame_nr].v_dc_modulator_100mV = v_dc_modulator_100mV;
			fast_monitor_vars[frame_nr].v_ac_100mV = v_ac_100mV;
			fast_monitor_vars[frame_nr].i_ac_10mA = i_ac_10mA;
			fast_monitor_vars[frame_nr].i_ac_ref_amp_10mA = debug_i_ac_ref_amp_10mA;
			frame_nr++;
		}
	}

	//DEBUG_ISR GPIOC->BRR = (1<<15);  // reset Testpin TP202 PC15; pin operation takes some extra time
	// from function enter to here
	// with -O3 and delta_v float calculation 25.58us
	// with -O3 and delta_v fixp calculation  19.08us  with -O2 19.14us
	// with -O3 without delta_v               17.76us

	return duty;
}


errorPVBI_t checkACLimits() {
	if ( v_dc_FBgrid_sincfilt_100mV > E_VDC_MAX_FB_GRID_100mV ) {
		return EC_V_DC_MAX_FB_GRID;
	}

	static uint8_t cnt_i_ac_rmslimit;  // todo: calculate rms limit based on actual chip temperature
	if ( i_ac_10mA > E_I_AC_PULSE_MAX_AMP_10mA || i_ac_10mA < -E_I_AC_PULSE_MAX_AMP_10mA) {
		return EC_I_AC_PULSE_MAX;
	} else if ( i_ac_10mA > E_I_AC_RMS_MAX_AMP_10mA || i_ac_10mA < -E_I_AC_RMS_MAX_AMP_10mA) {
		permil_v_dffw = std::clamp(permil_v_dffw+PERMIL_V_DFFW_INCR, PERMIL_V_DFFW_MIN, PERMIL_V_DFFW_MAX);

		if (cnt_i_ac_rmslimit < E_I_AC_RMS_MAX_CNT) {
			cnt_i_ac_rmslimit++;
		} else {
			return EC_I_AC_RMS_MAX;
		}
	} else {
		if (cnt_i_ac_rmslimit > 0) cnt_i_ac_rmslimit--;
	}

	if (cnt_i_ac_rmslimit == 0) {
		permil_v_dffw = std::clamp(permil_v_dffw-PERMIL_V_DFFW_DECR, PERMIL_V_DFFW_MIN, PERMIL_V_DFFW_MAX);
	}

	return EC_NO_ERROR;
}


void measVdcFBgrid()
{

	// sigma delta bitstream with 10MHz
	// 10MHz/20kHz = 500 -> 250 high periods equal 0V
	// v1: gated counter -> not precise, tested with 50kHz
	//     100*100ns sampled with 170MHz -> cnt=1700 at 0V, measured 1760-1811
	// v2: Vdc is close to Vadc_max → only single zeros occur and can be counted with simple rising/falling edge counter
	//     0V = 250 edges
	//     e.g. voltage divider R1=1k R2=10k
	//     11V = 50 edges, because sigma delta outputs 90% ones at Vadc_max
//#define VIN_ADCR (9.67/9.81 * 11/1)  // adc range in volts ~[0,11.0V]  -> @9.67V,dec=16 : 9.66V to 9.70V
//#define VIN_ADCR (414.7/1)  // adc range in volts ~[0,414.7V]  -> @9.67V : dec=16 : 369.1 to 370.3V ; dec=32 : 369.1 to 370.3V -> same
//#define VIN_ADCR (450/1)  // adc range in volts ~[0,414.7V]  -> @9.67V :  dec=32 : 3s.1 to 3s3V -> same

	//define above
//#define VIN_ADCR (450/1)  // adc range in volts ~[0,414.7V]  -> 20kHz  dec=16 :
	// @0.00V Vdc=59.2-178.9V, re=136-231
	// @3.41V Vdc=173.8-174.9V, re=167-177
	// @4.81V Vdc=210.2-213.1V, re=155-158
	// @6.46V Vdc=271.9-272.9V, re=128-130
	// @7.78V Vdc=327.2-327.6V, re=103-104
	// @9.55V Vdc=400.6-401.2V, re=71-72
	// @12.57V Vdc=528.4-529.1V, re=14-16

	uint16_t sigma_delta_re = TIM2->CNT;
	//uint16_t sigma_delta_re = 250;  //for DC debugging todo remove
	TIM2->CNT = 0;

	// if sensor sees more than 1V, 90% high increase up to only a single zero in 128cycles, which equals 1.25V
	if (sigma_delta_re < 32 || sigma_delta_re > 500) {
		set_sys_errorcode(EC_V_DC_SENSOR_FB_GRID);
	}

	uint16_t filt_in = sigma_delta_re;

	// nominal voltage of battery: 96*3.7=355.2V
	// max voltage of ADC: 450V equals 90% ones
	// 50% + 355.2/450 * 40% = 81.6% ones
	// -> 8 of 10 bits are ones
	// => low probability of sequential zeros. Thus, edge counting should be sufficient!

